[
  {
    "link":"Front-end",
    "title":"Front-end developer",
    "level":"Junior",
    "description":"We are looking for a motivated and confident person who is willing to share his programming skills with us!",
    "person":"2",
    "content":"# Junior Frontend Developer\n\nWe are looking for a motivated and confident person who is willing to share his programming skills with us!\n\n### About CodeLane Solutions\n\nCodeLane software Solutions LLP or CodeLane Solutions formerly Codelane proprietorship is founded in March of 2021 since engages in the business of providing technology solutions, services, and products including various web services, cloud services, internet products, internet of thing, cyber security, digital marketing, artificial intelligence, marketing of business management software, UI/UX design, operating systems software, and data tabulating and processing services, database management, and distribution services; and designing, developing and maintaining websites; building software applications and technology applications for computers, mobile phones, and other devices and related activities like business outsourcing services, hardware, and software consultancy and training for the same by various modes both in India and overseas.\n\n### Your day-to-day:\n* Create visualizations that demonstrate insights discovered by clustering customer feedback.\n* Working with our designer, Figma, and being responsible for the dashboard’s functionality.\n* Making sure that features being implemented can be converted well into proposed UI.\n* Convert raw customer requirements into features and code.\n* Surface insights from our core insight engine onto front-end user-friendly dashboard.\n* Deliver results to customers through innovative visualizations and constantly iterate based on their feedback.\n* This is a brand new product with a new concept so being able to think of intuitive and simple ways to present complex insights to users is valued a lot!\n\n### You have some or all of the following skills and experience:\n* Familiar with all stages of web application development (design, implementation, testing)\n* Strong experience with frontend development\n* Experience with ES6 / Typescript, Webpack, Git, and PostCSS / Tailwind\n* Comfortable working on a fully remote team, with strong written communication and a willingness to actively collaborate with other remote team members\n* Experience of using Svelte or React or Vue is a plus (we're in the process of migrating to Svelte)\n\n* Value contributing to a respectful, open, transparent and evolving company culture\n\n### To Apply\n\nSend an email to jobs@codelane.co.in and include:\n* The position.\n* What excited you about the role.\n* Your resume, obviously.\n* Links to relevant work available online (github, etc).\n* A note or two about your interests outside of work. This is usually more interesting than the resume part."
  }
]
